Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: །གསོལ་པ། བཅོམ་ལྡན་འདས་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་གནས་ཤིང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་འཛིན་པ་ལགས། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Blessed Lord, how will bodhisattva great beings, abiding in the perfection of ethical discipline, acquire the perfection of wisdom?” “

source: རབ་འབྱོར་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་གནས་ཤིང་། ཆོས་གང་ཡང་འདུས་བྱས་སུ་མི་མཐོང་འདུས་མ་བྱས་སུ་མི་མཐོང་། དངོས་པོ་ཡོད་པ་འདུས་བྱས་སུ་མི་མཐོང་། དངོས་པོ་མེད་པ་འདུས་མ་བྱས་སུ་མི་མཐོང་། མཚན་མ་ཡོད་པ་འདུས་བྱས་སུ་མི་མཐོང་།
en: In this regard, Subhūti,” replied the Blessed One, “when bodhisattva great beings dwell in the perfection of ethical discipline, they do not perceive anything at all as conditioned, they do not perceive anything at all as unconditioned, they do not perceive entities as conditioned, they do not perceive nonentities as unconditioned, they do not perceive signs as conditioned, and they do not perceive signlessness as unconditioned.

source: མཚན་མ་མེད་པ་འདུས་མ་བྱས་སུ་མི་མཐོང་། གཞན་དུ་ན་ཆོས་གང་ཡང་དེ་བཞིན་ཉིད་ལས་འདའ་བ་མེད་པ་ལས་ཕར་ཆོས་གང་ཡང་ཡོད་པ་འམ། མེད་པར་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་སྟེ།
en: They do not transgress the real nature of all phenomena, and apart from that they do not observe anything elsewhere as existent or nonexistent.

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་ཐབས་མཁས་པ་དེས་ཉན་ཐོས་ཀྱི་ས་དང་། རང་སངས་རྒྱས་ཀྱི་སར་མི་ལྟུང་སྟེ།
en: Through this perfection of wisdom and skill in means, they do not regress to the level of the śrāvakas or the level of the pratyekabuddhas.

source: རབ་འབྱོར་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་གནས་ཤིང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་འཛིན་ཏོ།
en: It is in this way, Subhūti, that bodhisattva great beings, abiding in the perfection of ethical discipline, acquire the perfection of wisdom.” “

source: །གསོལ་པ། བཅོམ་ལྡན་འདས་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་གནས་ཤིང་། སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་འཛིན་པ་ལགས།
en: Blessed Lord, how will bodhisattva great beings, abiding in the perfection of tolerance, acquire the perfection of generosity?” “

source: རབ་འབྱོར་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སེམས་དང་པོ་བསྐྱེད་པ་ནས་ཉེ་བར་བཟུང་སྟེ། སྙིང་པོ་བྱང་ཆུབ་ལ་འདུག་གི་བར་དུ་སྦྱིན་པ་ཡོངས་སུ་གཏོང་བའི་ཚེ། སེམས་ཅན་ཐམས་ཅད་གཤེ་ཞིང་འཁྱལ་ལ། ཡན་ལག་དང་ཉིང་ལག་གཅོད་པར་གྱུར་ཀྱང་། དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་གནས་པ་དེ་འདི་སྙམ་དུ་སེམས་ཏེ།
en: V: 87} “when bodhisattva great beings dispense gifts, commencing from the time when they first begin to set their mind on enlightenment until they are seated at the site of enlightenment, if all beings were to scold and reprimand them and even cut off their limbs and appendages, those bodhisattva great beings, abiding in the perfection of tolerance, would think, ‘I shall dispense gifts to those beings!

source: སེམས་ཅན་འདི་དག་ལ་ནི་བདག་གིས་སྦྱིན་པ་ཡོངས་སུ་གཏང་བར་བྱའི། སྦྱིན་པ་ཡོངས་སུ་མི་གཏང་བར་བྱ་བ་མ་ཡིན་ནོ་ཞེས་ཏེ།
en: I will not desist from dispensing gifts to them!’

source: དེ་སེམས་ཅན་དེ་དག་ཟས་འདོད་པ་ལ་ནི་ཟས། སྐོམ་འདོད་པ་ལ་ནི་སྐོམ། བཞོན་པ་འདོད་པ་ལ་ནི་བཞོན་པ། གོས་འདོད་པ་ལ་ནི་གོས། མེ་ཏོག་འདོད་པ་ལ་ནི་མེ་ཏོག །ཕྲེང་བ་འདོད་པ་ལ་ནི་ཕྲེང་བ། སྤོས་འདོད་པ་ལ་ནི་སྤོས། བྱུག་པ་འདོད་པ་ལ་ནི་བྱུག་པ། མལ་ཆ་འདོད་པ་ལ་ནི་མལ་ཆ། གནས་འདོད་པ་ལ་ནི་གནས། འཚོ་བ་འདོད་པ་ལ་ནི་འཚོ་བ། ཡོ་བྱད་འདོད་པ་ལ་མིའི་ཡོ་བྱད། གང་ཅི་ཡང་རུང་བའི་བར་དུ་ཡོངས་སུ་གཏོང་སྟེ།
en: They give food to those beings who need food, drinks to those who need drinks, transport to those who need transport, clothing to those who need clothing, flowers to those who need flowers, garlands to those who need garlands, incense to those who need incense, unguents to those who need unguents, bedding to those who need bedding, sanctuary to those who need sanctuary, sustenance to those who need sustenance, up to and including all manner of things that are useful to human beings, to those who are in need of resources.

source: དགེ་བའི་རྩ་བ་དེ་དག་ཀྱང་སེམས་ཅན་ཐམས་ཅད་དང་ཐུན་མོང་དུ་བྱས་ཤིང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་ཡོངས་སུ་བསྔོ་སྟེ། ཅི་ནས་ཀྱང་གང་ཡོངས་སུ་བསྔོ་བ་དང་། ཅི་ཡོངས་སུ་བསྔོ་བ་དང་། གང་ལ་ཡོངས་སུ་བསྔོ་བའི་བློ་རྣམ་པ་གསུམ་དུ་མི་འགྱུར་བ་དེ་ལྟར་ཡོངས་སུ་བསྔོ་སྟེ།
en: Making common cause with all beings, they indeed dedicate those roots of virtuous action to all-aspect omniscience, and they make this dedication in such a way that by all means they do not resort to the threefold mental interaction between the one who makes the dedication, the dedication that is made, and the one to whom the dedication is made.

source: རབ་འབྱོར་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་གནས་ཤིང་སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་འཛིན་ཏོ།
en: It is in this way, Subhūti, that bodhisattva great beings, abiding in the perfection of tolerance, acquire the perfection of generosity.” “

source: །གསོལ་པ། བཅོམ་ལྡན་འདས་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་གནས་ཤིང་། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་འཛིན་པ་ལགས། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སེམས་དང་པོ་བསྐྱེད་པ་ནས་ཉེ་བར་བཟུང་སྟེ།
en: Blessed Lord, how will bodhisattva great beings, abiding in the perfection of tolerance, acquire the perfection of ethical discipline?” “

source: སྙིང་པོ་བྱང་ཆུབ་ལ་འདུག་གི་བར་དུ་སེམས་ཅན་ཡིན་ནོ་ཅོག་གི་སྲོག་མི་གཅོད་དོ། །མ་བྱིན་པར་མི་ལེན་ཏོ། །འདོད་པས་ལོག་པར་མི་གཡེམ་མོ། །རྫུན་གྱི་ཚིག་མི་སྨྲའོ། །ཕྲ་མའི་ཚིག་མི་སྨྲའོ། །ཞེ་གཅོད་པའི་ཚིག་མི་སྨྲའོ། །ཚིག་ཀྱལ་པ་མི་སྨྲའོ།
en: In this regard, Subhūti,” replied the Blessed One, “bodhisattva great beings, commencing from the time when they first begin to set their mind on enlightenment until they are seated at the site of enlightenment, will not deprive any being of life, will not steal, will not commit sexual misconduct, will not tell lies, will not slander, will not speak words of reprimand, will not speak nonsensically, will not be covetous, will not be malicious, and will not resort to wrong views.

source: །ཆགས་སེམས་སུ་མི་བྱེད་དོ། །གནོད་སེམས་སུ་མི་བྱེད་དོ། །ལོག་པར་མི་ལྟའོ། །དེའི་སེམས་ཀྱང་ཉན་ཐོས་ཀྱི་ས་འམ། རང་སངས་རྒྱས་ཀྱི་ས་ལ་མི་འཇུག་སྟེ།
en: Indeed, their minds will never engage with the level of the śrāvakas or the level of the pratyekabuddhas.

source: དགེ་བའི་རྩ་བ་དེ་ཡང་སེམས་ཅན་ཐམས་ཅད་དང་ཐུན་མོང་དུ་བྱས་ཏེ། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་བསྔོ་སྟེ། ཅི་ནས་ཀྱང་གང་ཡོངས་སུ་བསྔོ་བ་དང་། ཅི་ཡོངས་སུ་བསྔོ་བ་དང་། གང་ལ་ཡོངས་སུ་བསྔོ་བའི་བློ་རྣམ་པ་གསུམ་དུ་མི་འགྱུར་བ་དེ་ལྟར་ཡོངས་སུ་བསྔོ་སྟེ།
en: They will also dedicate these roots of virtuous action, making common cause with all beings, toward unsurpassed, complete enlightenment, and they will make this dedication in such a way that by all means they do not resort to the threefold mental interaction between the one who makes the dedication, the dedication that is made, and the one to whom the dedication is made.

source: རབ་འབྱོར་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་གནས་ཤིང་། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་འཛིན་ཏོ། །གསོལ་པ།
en: It is in this way, Subhūti, that bodhisattva great beings, abiding in the perfection of tolerance, acquire the perfection of ethical discipline.” “

source: བཅོམ་ལྡན་འདས་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་གནས་ཤིང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་འཛིན་པ་ལགས། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་གནས་ཤིང་། བརྩོན་འགྲུས་འདི་ལྟ་བུ་ཡོངས་སུ་བསྐྱེད་དེ།
en: Blessed Lord, how will bodhisattva great beings, abiding in the perfection of tolerance, acquire the perfection of perseverance?” {

source: བདག་གིས་དཔག་ཚད་དམ། དཔག་ཚད་བརྒྱ་འམ། དཔག་ཚད་སྟོང་ངམ། དཔག་ཚད་བརྒྱ་ཕྲག་སྟོང་ངམ། དཔག་ཚད་བྱེ་བ་འམ། དཔག་ཚད་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་ཕྲག་སྟོང་གི་བར་རམ།
en: Ki.

source: འཇིག་རྟེན་གྱི་ཁམས་བརྒྱ་འམ། འཇིག་རྟེན་གྱི་ཁམས་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་ཕྲག་སྟོང་གི་བར་དུ་སོང་སྟེ། དེ་དག་ཏུ་ཆུང་ངུ་ན་སེམས་ཅན་འགའ་ཙམ་ཡང་སྐྱབས་སུ་འགྲོ་བ་འམ། བསླབ་པའི་གནས་ལ་གཞག་པར་བྱའོ། །བཟོད་པ་འམ།
en: V: 88} “In this regard, Subhūti,” replied the Blessed One, “bodhisattva great beings, abiding in the perfection of tolerance, would cultivate perseverance, saying, ‘After traveling for one yojana, a hundred yojanas, a thousand yojanas, a hundred thousand yojanas, ten million yojanas, and so on, up to a hundred billion trillion yojanas, through a hundred world systems, and so on, up to a hundred billion trillion world systems, I shall at least establish a few beings in the refuge or in the precepts.

source: རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་འམ། ལན་ཅིག་ཕྱིར་འོང་བའི་འབྲས་བུ་འམ། ཕྱིར་མི་འོང་བའི་འབྲས་བུ་འམ། དགྲ་བཅོམ་པ་ཉིད་དམ། རང་བྱང་ཆུབ་འམ།
en: I shall establish them in [the level of eightfold] receptiveness, in the fruit of entering the stream to nirvāṇa, the fruit of being destined for only one more rebirth, the fruit of no longer being subject to rebirth, and arhatship, up to individual enlightenment, or unsurpassed, complete enlightenment!’

source: བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལ་རབ་ཏུ་གཞག་པར་བྱའོ་ཞེས་བརྩོན་འགྲུས་རྩམ་སྟེ། དགེ་བའི་རྩ་བ་དེ་དག་ཀྱང་སེམས་ཅན་ཐམས་ཅད་དང་ཐུན་མོང་དུ་བྱས་ཤིང་། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་བསྔོ་སྟེ།
en: They will also dedicate their roots of virtuous action, making common cause with all beings, toward unsurpassed, complete enlightenment.

source: རབ་འབྱོར་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་གནས་ཤིང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་འཛིན་ཏོ།
en: It is in this way, Subhūti, that bodhisattva great beings, abiding in the perfection of tolerance, acquire the perfection of perseverance.” “

source: །གསོལ་པ། བཅོམ་ལྡན་འདས་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་གནས་ཤིང་། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་འཛིན་པ་ལགས། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་གནས་ཤིང་།
en: Blessed Lord, how will bodhisattva great beings, abiding in the perfection of tolerance, acquire the perfection of meditative concentration?” “

source: འདི་ལྟར་འདོད་པ་ལས་དབེན་པ། སྡིག་པ་མི་དགེ་བའི་ཆོས་ལས་དབེན་པ། རྟོག་པ་དང་བཅས་པ། དཔྱོད་པ་དང་བཅས་པ། དབེན་པ་ལས་སྐྱེས་པའི་དགའ་བ་དང་བདེ་བ་ཅན་བསམ་གཏན་དང་པོ་ལ་ཉེ་བར་བསྒྲུབས་ཏེ་གནས་སོ།
en: In this regard, Subhūti,” replied the Blessed One, “bodhisattva great beings, abiding in the perfection of tolerance, achieve and then maintain the first meditative concentration, which is free from the desires [of the senses], free from negative and nonvirtuous attributes, and endowed with ideation and scrutiny, alongside the joy and bliss that arise from that freedom.

source: །བསམ་གཏན་གཉིས་པ་ལ་ཉེ་བར་བསྒྲུབས་ཏེ་གནས་སོ།
en: They achieve and maintain the second meditative concentration.

source: །བསམ་གཏན་གསུམ་པ་ལ་ཉེ་བར་བསྒྲུབས་ཏེ་གནས་སོ། །བསམ་གཏན་བཞི་པ་ལ་ཉེ་བར་བསྒྲུབས་ཏེ་གནས་སོ།
en: They achieve and maintain the third meditative concentration, and they achieve and maintain the fourth meditative concentration.

source: །འགོག་པའི་སྙོམས་པར་འཇུག་པའི་བར་ལ་ཉེ་བར་བསྒྲུབས་ཏེ་གནས་སོ།
en: They achieve and maintain [the formless absorptions], up to and including the absorption in cessation.

source: །སེམས་དང་སེམས་ལས་བྱུང་བའི་ཆོས་དགེ་བའི་རྩ་བ་དང་ལྡན་པ་གང་དང་གང་སྐྱེས་པ་ཐམས་ཅད་ཀྱང་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་ཡོངས་སུ་བསྔོའོ།
en: They also dedicate all the attributes of mind and mental states that arise in association with the roots of virtuous action to all-aspect omniscience.

source: །དེ་ཡང་ཅི་ནས་ཀྱང་དེའི་ཚེ། བསམ་གཏན་དང་། བསམ་གཏན་གྱི་ཡན་ལག་རྣམས་མི་དམིགས་པ་དེ་ལྟར་ཡོངས་སུ་བསྔོ་སྟེ།
en: At that time, they by all means make this dedication in such a way that the meditative concentrations and the branches of meditative concentration are not apprehended.

source: རབ་འབྱོར་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་གནས་ཤིང་། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་འཛིན་ཏོ།
en: It is in this way, Subhūti, that bodhisattva great beings, abiding in the perfection of tolerance, acquire the perfection of meditative concentration.” “

source: །གསོལ་པ། བཅོམ་ལྡན་འདས་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་གནས་ཤིང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་འཛིན་པ་ལགས།
en: Blessed Lord, how will bodhisattva great beings, abiding in the perfection of tolerance, acquire the perfection of wisdom?” “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་གནས་ཤིང་། གང་གི་ཚེ་ཆོས་རྣམས་ལ་དབེན་པའི་རྣམ་པ་འམ། ཞི་བའི་རྣམ་པ་འམ། མི་ཟད་པའི་རྣམ་པར་ཆོས་ཀྱི་རྗེས་སུ་ལྟ་ཞིང་གནས་ཀྱང་སྙིང་པོ་བྱང་ཆུབ་ལ་ནམ་འདུག་གི་བར་དུ་ཆོས་ཉིད་དེ་མངོན་དུ་མི་བྱེད་དེ།
en: In this regard, Subhūti,” replied the Blessed One, “even though bodhisattva great beings, abiding in the perfection of tolerance, survey and dwell in the principle of voidness, the principle of peace, the principle of the ending [of contaminants], and the principle of cessation with respect to all phenomena, they do not actualize reality until they are seated at the site of enlightenment.

source: སྙིང་པོ་བྱང་ཆུབ་ལ་འདུག་ནས་ཀྱང་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཐོབ་པར་བྱེད་དོ།
en: It is after they are seated at the site of enlightenment that they attain all-aspect omniscience. {

source: །དེ་ལས་ལངས་ནས་ཆོས་ཀྱི་འཁོར་ལོ་ཡང་བསྐོར་ཏེ།
en: Ki.V: 89} Then, arising from their seat [at the site of enlightenment], they turn the wheel of the Dharma.

source: རབ་འབྱོར་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་གནས་ཤིང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་འཛིན་ཏེ།
en: It is in this way, Subhūti, that bodhisattva great beings, abiding in the perfection of tolerance, acquire the perfection of wisdom.

source: ཅི་ནས་ཀྱང་མི་སྤོང་། མི་འཛིན་པ་དེ་ལྟར་ཡོངས་སུ་འཛིན་ཏོ།
en: They acquire it in such a way that they do not abandon it and do not grasp it in any way.” “

source: །གསོལ་པ། བཅོམ་ལྡན་འདས་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་གནས་ཤིང་། སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་འཛིན་པ་ལགས།
en: Blessed Lord, how will bodhisattva great beings, abiding in the perfection of perseverance, acquire the perfection of generosity?” “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་གནས་ཤིང་། ལུས་དང་སེམས་ཀྱིས་བརྩོན་པ་མི་འདོར་བ་ཡིན་ཏེ།
en: In this regard, Subhūti,” replied the Blessed One, “bodhisattva great beings, abiding in the perfection of perseverance, do not forsake perseverance by means of body or mind.

source: བདག་གིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་མི་རྒྱ་བར་མི་བྱའི།
en: They think, ‘There is no possibility that I will not attain consummate buddhahood in unsurpassed, complete enlightenment!

source: བདག་གིས་ནི་གདོན་མི་ཟ་བར་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་བྱའོ། ཞེས་དེ་སེམས་ཅན་རྣམས་ཀྱི་དོན་དུ་དཔག་ཚད་དམ།
en: I shall certainly attain consummate buddhahood in unsurpassed, complete enlightenment!’

source: དཔག་ཚད་བརྒྱ་འམ། དཔག་ཚད་སྟོང་ངམ། དཔག་ཚད་བརྒྱ་ཕྲག་སྟོང་ངམ། འཇིག་རྟེན་གྱི་ཁམས་སམ། འཇིག་རྟེན་གྱི་ཁམས་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་ཕྲག་སྟོང་གི་བར་དག་ཏུ་སོང་ཞིང་།
en: For the sake of beings, they would travel one yojana, a hundred yojanas, a thousand yojanas, a hundred thousand yojanas, or through a single world system to anything up to one hundred billion trillion world systems.

source: བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་གནས་ཏེ། ཆུང་ངུ་ན་སེམས་ཅན་འགའ་ཙམ་ཡང་བྱང་ཆུབ་ལ་རབ་ཏུ་འཇོག་གོ །
en: Abiding in the perfection of perseverance, they at least establish a single being in enlightenment.

source: གལ་ཏེ་གང་ཟག་བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་པ་དང་མ་ཕྲད་ན་ཡང་། དེ་དག་ཏུ་གང་ཟག་ཉན་ཐོས་ཀྱི་ཐེག་པ་པ་ནི་ཉན་ཐོས་ཀྱི་ས་ལ་རབ་ཏུ་གཞོག་གོ །
en: Even if they do not encounter an individual who follows the vehicle of the bodhisattvas, they will establish an individual who follows the vehicle of the śrāvakas in the level of the śrāvakas.

source: གང་ཟག་རང་སངས་རྒྱས་ཀྱི་ཐེག་པ་པ་ནི་རང་སངས་རྒྱས་ཀྱི་ས་ལ་རབ་ཏུ་གཞོག་སྟེ།
en: They will establish an individual who follows the vehicle of the pratyekabuddhas in the level of the pratyekabuddhas.

source: ཆུང་ངུ་ན་སེམས་ཅན་འགའ་ཙམ་ཡང་དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་ལ་རབ་ཏུ་གཞོག་གོ །
en: At the very least they will establish a single being in the paths of the ten virtuous actions.

source: དེས་ཆོས་ཀྱི་སྦྱིན་པ་དེ་དག་བྱིན་ནས་ཟང་ཟིང་གི་སྦྱིན་པས་སེམས་ཅན་རྣམས་ཚིམ་པར་བྱེད་དེ། དགེ་བའི་རྩ་བ་དེ་ཡང་ཉན་ཐོས་ཀྱི་ས་འམ། རང་སངས་རྒྱས་ཀྱི་སར་ཡོངས་སུ་མི་བསྔོའི།
en: After imparting these gifts of the Dharma, they satisfy beings with material gifts, but they do not at all dedicate these roots of virtuous action to the level of the śrāvakas or the level of the pratyekabuddhas.

source: གཞན་དུ་ན་སེམས་ཅན་ཐམས་ཅད་དང་ཐུན་མོང་དུ་བྱས་ཤིང་། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་བསྔོ་སྟེ།
en: Rather, making common cause with all beings, they make this dedication to unsurpassed, complete enlightenment.

source: རབ་འབྱོར་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་གནས་ཤིང་། སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་འཛིན་ཏོ།
en: It is in this way, Subhūti, that bodhisattva great beings, abiding in the perfection of perseverance, acquire the perfection of generosity.” “

source: །གསོལ་པ། བཅོམ་ལྡན་འདས་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་གནས་ཤིང་། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་འཛིན་པ་ལགས།
en: Blessed Lord, how will bodhisattva great beings, abiding in the perfection of perseverance, acquire the perfection of ethical discipline?” {

source: རབ་འབྱོར་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སེམས་དང་པོ་བསྐྱེད་པ་ནས་ཉེ་བར་བཟུང་སྟེ། སྙིང་པོ་བྱང་ཆུབ་ལ་འདུག་གི་བར་དུ་བདག་གིས་ཀྱང་སྲོག་གཅོད་པ་སྤངས་པ་ཡིན། གཞན་ཡང་སྲོག་གཅོད་པ་སྤང་བ་ལ་ཡང་དག་པར་བསྐུལ་བ་ཡིན། སྲོག་གཅོད་པ་སྤོང་བའི་ལེགས་པ་བརྗོད་པ་ཡིན།
en: V: 90} “In this regard, Subhūti,” replied the Blessed One, “bodhisattva great beings think, ‘From the time when I first begin to set my mind on enlightenment until I am seated at the site of enlightenment, I shall indeed abstain from killing living creatures, and I shall encourage others to keep abstaining from killing living creatures.

source: གཞན་གང་གིས་སྲོག་གཅོད་པ་སྤངས་པ་དེ་དག་གི་ལེགས་པ་བརྗོད་ཅིང་འཐུན་པས་དགའ་བར་བྱེད་པ་ཡིན་ནོ།
en: I shall praise abstention from killing living creatures, and I shall praise and take empathetic delight in others abstaining from killing living creatures.

source: །བདག་གིས་ཀྱང་མ་བྱིན་པར་ལེན་པ་སྤངས་པ་ཡིན། གཞན་ཡང་མ་བྱིན་པར་ལེན་པ་སྤོང་བ་ལ་ཡང་དག་པར་བསྐུལ་བ་ཡིན།
en: I shall indeed abstain from stealing, and I shall encourage others to keep abstaining from stealing.

source: མ་བྱིན་པར་ལེན་པ་སྤོང་བའི་ལེགས་པ་བརྗོད་པ་ཡིན། གཞན་གང་གིས་མ་བྱིན་པར་ལེན་པ་སྤོང་བ་དེ་དག་གི་ལེགས་པ་བརྗོད་ཅིང་འཐུན་པས་དགའ་བར་བྱེད་པ་ཡིན། བདག་གིས་ཀྱང་འདོད་པས་ལོག་པར་གཡེམ་པ་སྤངས་པ་ཡིན།
en: I shall praise abstention from stealing, and I shall praise and take empathetic delight in others abstaining from stealing.

source: གཞན་ཡང་འདོད་པས་ལོག་པར་གཡེམ་པ་སྤོང་བ་ལ་ཡང་དག་པར་བསྐུལ་བ་ཡིན། འདོད་པས་ལོག་པར་གཡེམ་པ་སྤོང་བའི་ལེགས་པ་བརྗོད་པ་ཡིན།
en: I shall indeed abstain from sexual misconduct, and I shall encourage others to keep abstaining from sexual misconduct.

source: གཞན་གང་གིས་འདོད་པས་ལོག་པར་གཡེམ་པ་སྤངས་པ་དེ་དག་གི་ལེགས་པ་བརྗོད་ཅིང་འཐུན་པས་དགའ་བར་བྱེད་པ་ཡིན།
en: I shall praise abstention from sexual misconduct, and I shall praise and take empathetic delight in others abstaining from sexual misconduct.

source: བདག་གིས་ཀྱང་བརྫུན་དུ་སྨྲ་བ་སྤངས་པ་ཡིན། གཞན་ཡང་བརྫུན་དུ་སྨྲ་བ་སྤངས་པ་ལ་ཡང་དག་པར་བསྐུལ་བ་ཡིན།
en: I shall indeed abstain from the telling of lies, and I shall encourage others to keep abstaining from the telling of lies.

source: བརྫུན་དུ་སྨྲ་བ་སྤོང་བའི་ལེགས་པ་བརྗོད་པ་ཡིན། གཞན་གང་གིས་བརྫུན་དུ་སྨྲ་བ་སྤངས་པ་དེ་དག་གི་ལེགས་པ་བརྗོད་ཅིང་འཐུན་པས་དགའ་བར་བྱེད་པ་ཡིན།
en: I shall praise abstention from the telling of lies, and I shall praise and take empathetic delight in others abstaining from the telling of lies.

source: བདག་གིས་ཀྱང་ཕྲ་མ་སྤངས་པ་ཡིན། གཞན་ཡང་ཕྲ་མ་སྤོང་བ་ལ་ཡང་དག་པར་བསྐུལ་བ་ཡིན།
en: I shall indeed abstain from slander, and I shall encourage others to keep abstaining from slander.

source: ཕྲ་མ་སྤོང་བའི་ལེགས་པ་བརྗོད་པ་ཡིན། གཞན་གང་གིས་ཕྲ་མ་སྤངས་པ་དེ་དག་གི་ལེགས་པ་བརྗོད་ཅིང་འཐུན་པས་དགའ་བར་བྱེད་པ་ཡིན།
en: I shall praise abstention from slander, and I shall praise and take empathetic delight in others abstaining from slander.

source: བདག་གིས་ཀྱང་ཞེ་གཅོད་པའི་ཚིག་སྤངས་པ་ཡིན། གཞན་ཡང་ཞེ་གཅོད་པའི་ཚིག་སྤོང་བ་ལ་ཡང་དག་པར་བསྐུལ་བ་ཡིན།
en: I shall indeed abstain from words of reprimand, and I shall encourage others to keep abstaining from words of reprimand.

source: ཞེ་གཅོད་པའི་ཚིག་སྤོང་བའི་ལེགས་པ་བརྗོད་པ་ཡིན། གཞན་གང་གིས་ཞེ་གཅོད་པའི་ཚིག་སྤངས་པ་དེ་དག་གི་ལེགས་པ་བརྗོད་ཅིང་འཐུན་པས་དགའ་བར་བྱེད་པ་ཡིན།
en: I shall praise abstention from words of reprimand, and I shall praise and take empathetic delight in others abstaining from words of reprimand.

source: བདག་གིས་ཀྱང་ཚིག་ཀྱལ་པ་སྤངས་པ་ཡིན། གཞན་ཡང་ཚིག་ཀྱལ་པ་སྤོང་བ་ལ་ཡང་དག་པར་བསྐུལ་བ་ཡིན།
en: I shall indeed abstain from nonsensical chatter, and I shall encourage others to keep abstaining from nonsensical chatter.

source: ཚིག་ཀྱལ་པ་སྤོང་བའི་ལེགས་པ་བརྗོད་པ་ཡིན། གཞན་གང་གིས་ཚིག་ཀྱལ་པ་སྤངས་པ་དེ་དག་གི་ལེགས་པ་བརྗོད་ཅིང་འཐུན་པས་དགའ་བར་བྱེད་པ་ཡིན།
en: I shall praise abstention from nonsensical chatter, and I shall praise and take empathetic delight in others abstaining from nonsensical chatter.

source: བདག་གིས་ཀྱང་ཆགས་སེམས་སྤངས་པ་ཡིན། གཞན་ཡང་ཆགས་སེམས་སྤོང་བ་ལ་ཡང་དག་པར་བསྐུལ་བ་ཡིན།
en: I shall indeed abstain from covetousness, and I shall encourage others to keep abstaining from covetousness.

source: ཆགས་སེམས་སྤོང་བའི་ལེགས་པ་བརྗོད་པ་ཡིན། གཞན་གང་གིས་ཆགས་སེམས་སྤངས་པ་དེ་དག་གི་ལེགས་པ་བརྗོད་ཅིང་འཐུན་པས་དགའ་བར་བྱེད་པ་ཡིན།
en: I shall praise abstention from covetousness, and I shall praise and take empathetic delight in others abstaining from covetousness.

source: བདག་གིས་ཀྱང་གནོད་སེམས་སྤངས་པ་ཡིན། གཞན་ཡང་གནོད་སེམས་སྤོང་བ་ལ་ཡང་དག་པར་བསྐུལ་བ་ཡིན།
en: I shall indeed abstain from malice, and I shall encourage others to keep abstaining from malice.

source: གནོད་སེམས་སྤོང་བའི་ལེགས་པ་བརྗོད་པ་ཡིན། གཞན་གང་གིས་གནོད་སེམས་སྤངས་པ་དེ་དག་གི་ལེགས་པ་བརྗོད་ཅིང་འཐུན་པས་དགའ་བར་བྱེད་པ་ཡིན།
en: I shall praise abstention from malice, and I shall praise and take empathetic delight in others abstaining from malice.

source: བདག་གིས་ཀྱང་ལོག་པར་ལྟ་བ་སྤངས་པ་ཡིན། གཞན་ཡང་ལོག་པར་ལྟ་བ་སྤོང་བ་ལ་ཡང་དག་པར་བསྐུལ་བ་ཡིན།
en: I shall indeed abstain from wrong views, and I shall encourage others to keep abstaining from wrong views.

source: ལོག་པར་ལྟ་བ་སྤོང་བའི་ལེགས་པ་བརྗོད་པ་ཡིན།
en: I shall praise abstention from wrong views, {Ki.

source: གཞན་གང་གིས་ལོག་པར་ལྟ་བ་སྤངས་པ་དེ་དག་གི་ལེགས་པ་བརྗོད་ཅིང་འཐུན་པས་དགའ་བར་བྱེད་པ་ཡིན་ཏེ།
en: V: 91} and I shall praise and take empathetic delight in others abstaining from wrong views!’

source: ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དེས་འདོད་པའི་ཁམས་སུ་གནས་པར་མི་བྱེད། གཟུགས་ཀྱི་ཁམས་སུ་གནས་པར་མི་བྱེད། གཟུགས་མེད་པའི་ཁམས་སུ་གནས་པར་མི་བྱེད།
en: Through this perfection of ethical discipline, they do not strive for the realm of desire, they do not strive for the realm of form, and they do not strive for the realm of formlessness.

source: ཉན་ཐོས་ཀྱི་ས་འམ། རང་སངས་རྒྱས་ཀྱི་ས་ལ་གནས་པར་མི་བྱེད་དེ།
en: They do not strive for the level of the śrāvakas or the level of the pratyekabuddhas.

source: གཞན་དུ་ན་དགེ་བའི་རྩ་བ་དེ་དག་སེམས་ཅན་ཐམས་ཅད་དང་ཐུན་མོང་དུ་བྱས་ཤིང་། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་བསྔོ་སྟེ། ཅི་ནས་ཀྱང་གང་ཡོངས་སུ་བསྔོ་བ་དང་། ཅི་ཡོངས་སུ་བསྔོ་བ་དང་། གང་ལ་ཡོངས་སུ་བསྔོ་བའི་བློ་རྣམ་པ་གསུམ་དུ་མི་འགྱུར་བ་དེ་ལྟར་ཡོངས་སུ་བསྔོ་སྟེ།
en: Rather, making common cause with all beings, they dedicate those roots of virtuous action toward unsurpassed, complete enlightenment, and they make this dedication in such a way that by all means they do not resort to the threefold mental interaction between the one who makes the dedication, the dedication that is made, and the one to whom the dedication is made.
